/*2023—7—13*/
/*运算符 程序流程结构 */
/*
快捷注释 选中 CTRL+K 再CTRL+C
快捷取消注释 选中 CTRL+K 再CTRL+U
*/

/* 运算符
算术运算符  加 正号(+)、减（-）、乘（*）、除（/）【整数相除取整，小数相除取小数，注意除数不能为0】
			、取模（%）【结果取余数】、前置递增（++a）、后置递增（a++）、前置递减（--a）、后置递减（a--）
赋值运算符	等于（=）、加等于（+=）、减等于（-=）、除等于（/=）、模等于（%=）、乘等于（*=）【a %= b   =》 a = a % b】
比较运算符	相等于（==）、不等于（！=）、大于、小于、大于等于（>=）、小于等于（<=）【注意 在输出时 << 的优先级大于 比较运算符】
逻辑运算符	非（！）、与（&&）【同真为真、一假全假】、或（||）【同假全假、其余为真】
*/

/*程序结构
	选择结构	if语句、三目运算符、switch语句
	嵌套结构	
	循环结构	
*/

#include <iostream>

using namespace std;

int main2(){
	int a0 = 1, a1 = 2;
	double b0 = 1.3, b1 = 0.4;

	cout << "整数相除：" << a0 / a1 << endl << "小数相除：" << b0 / b1 << endl;
	cout << endl;

	/*取模运算时，被除数小于除数时，结果为本身   两个数不能为小数*/
	int c0 = 5, c1 = 10;
	double c2 = 2.5, c3 = 0.25;
	cout << "被除数小于除数时：" << c0 % c1 << endl;
	/*cout << "两个数为小数时：" << c2 % c3 << endl;
	cout << "除数为小数时：" << c1 % c3 << endl;
	cout << "被除数为小数时：" << c2 % c0 << endl;  3种错误*/
	cout << endl;

	int d0 = 10;
	int d3 = 10;
	int d1 = ++d0 * 10;  /*前置++ 先让变量加1，在运算表达式*/
	int d2 = d3++ * 10;  /*后置++ 先运算表达式，在加1*/
	cout << "d0 = " << d0 <<endl;
	cout << "d1 = " << d1 <<endl;
	cout << "d3 = " << d3 <<endl;
	cout << "d2 = " << d2 <<endl;
	cout << endl;

	int score; //分数
	cout << "请输入分数" << endl;
	cin >> score;
	/*判断分数是否超过750分
		超过750分 提醒用户重新输入合理分数
		未超过750分 打印分数*/
	if(score > 750){
		cout << "重新输入合理分数!" << endl;
		cout << "请重新输入分数" << endl;
		cin >> score;
	}else{
		cout << "您的分数为：" << score << "分" << endl;
	}

	//if后面不加分号
	//大于等于600 考上一本大学 输出祝贺语句 
	//在一本分数中，大于700 考入北大 大于650 考入清华 大于等于600 考入人大
	//小于600 大于450 考上二本大学 输出祝福语句  
	//小于450 鼓励用户
	if(score >=  600){ 
		cout << "恭喜您考上一本大学！" << endl;
		if(score > 700){
			cout << "恭喜你考上了北京大学！" << endl;
		}else if(score >650){
			cout << "恭喜你考上了清华大学！" << endl;
		}else{
			cout << "恭喜你考上了中国人民大学！" << endl;
		}
	}else if(score < 600 && score >= 450){
		cout << "恭喜您考上二本大学！" << endl;
	}else{
		cout << "请不要气馁！" << endl;
	}

	system("pause");

	return 0;
}